{
  "course": "Financial Accounting",
  "topics": [
    {
      "topic": "Theoretical Framework",
      "subtopics": [
        "Accounting as an information system, the users of financial accounting information and their needs. Qualitative characteristics of accounting, information. Functions, advantages and limitations of accounting. Branches of accounting. Bases of accounting; cash basis and accrual basis.",
        "Financial accounting standards: Concept, benefits, procedure for issuing accounting standards in India. International Financial Reporting Standards (IFRS): - Need and procedures, Convergence to IFRS, Distinction between Indian Accounting Standards (Ind ASs) and Accounting Standards (ASs).",
        "The nature of financial accounting principles – Basic concepts and conventions: entity, money measurement, going concern, cost, realization, accruals, periodicity, consistency, prudence (conservatism), materiality and full disclosures."
      ]
    },
    {
      "topic": "Accounting Process",
      "subtopics": [
        "From recording of a business transaction to preparation of trial balance including adjustments: Capital and Revenue expenditure & receipts, Preparation trial balance, Profit and Loss Account and Balance Sheet(Sole Proprietorship only)."
      ]
    },
    {
      "topic": "Business Income",
      "subtopics": [
        "Inventories: Meaning. Significance of inventory valuation. Inventory Record Systems: periodic and perpetual. Methods: FIFO, LIFO and Weighted Average.",
        "Measurement of business income-Net income: the accounting period, the continuity doctrine and matching concept. Objectives of measurement.",
        "Revenue: concept, revenue recognition principles, recognition of expenses.",
        "The nature of depreciation. The accounting concept of depreciation. Factors in the measurement of depreciation. Methods of computing depreciation: straight line method and diminishing balance method; Disposal of depreciable assets-change of method."
      ]
    },
    {
      "topic": "Preparation of financial statements of not for profit organizations",
      "subtopics": [
        "nan"
      ]
    },
    {
      "topic": "Accounting for Hire Purchase and Installment System",
      "subtopics": [
        "Consignment, and Joint Venture,Accounting for Hire Purchase Transactions, Journal entries and ledger accounts in the books of Hire Vendors and Hire purchaser for large value items including default and repossession, stock and debtors system.",
        "Consignment, and Joint Venture,Consignment: Features, Accounting treatment in the books of the consignor and consignee.",
        "Consignment, and Joint Venture,Joint Venture: Accounting procedures: Joint Bank Account, Records Maintained by Co- venturer of (a) all transactions (b) only his own transactions. (Memorandum joint venture account)."
      ]
    },
    {
      "topic": "Accounting for Inland Branches",
      "subtopics": [
        "Inland Branches; Dependent branches only and Ascertainment of Profit by Debtors Method & Stock and Debtors Method."
      ]
    },
    {
      "topic": "Accounting for Dissolution of Partnership Firm",
      "subtopics": [
        "Dissolution of the Partnership Firm Including Insolvency of partners, sale to a limited company and piecemeal distribution."
      ]
    }
  ]
}